lwfinger/rtl8723au/os_dep/ioctl_linux.c
					if((xmit_frame=rtw_IOL_accquire_xmit_frame(padapter)) == NULL) {
						ret = -ENOMEM;
						break;
					}

					rtw_IOL_append_LLT_cmd(xmit_frame, page_boundary);


					if(_SUCCESS != rtw_IOL_exec_cmds_sync(padapter, xmit_frame, 500,0) )
						ret = -EPERM;
				}
			}
				break;
			case 0x05: //blink LED test
			{
				u16 reg = 0x4c;
				u32 blink_num = 50;
				u32 blink_delay_ms = 200;
				int i;

				{
					struct xmit_frame	*xmit_frame;

					if((xmit_frame=rtw_IOL_accquire_xmit_frame(padapter)) == NULL) {
						ret = -ENOMEM;
						break;
					}

					for(i=0;i<blink_num;i++){
						#ifdef CONFIG_IOL_NEW_GENERATION
						rtw_IOL_append_WB_cmd(xmit_frame, reg, 0x00,0xff);
						rtw_IOL_append_DELAY_MS_cmd(xmit_frame, blink_delay_ms);
						rtw_IOL_append_WB_cmd(xmit_frame, reg, 0x08,0xff);
						rtw_IOL_append_DELAY_MS_cmd(xmit_frame, blink_delay_ms);
						#else
						rtw_IOL_append_WB_cmd(xmit_frame, reg, 0x00);
						rtw_IOL_append_DELAY_MS_cmd(xmit_frame, blink_delay_ms);
						rtw_IOL_append_WB_cmd(xmit_frame, reg, 0x08);
						rtw_IOL_append_DELAY_MS_cmd(xmit_frame, blink_delay_ms);
						#endif
					}
					if(_SUCCESS != rtw_IOL_exec_cmds_sync(padapter, xmit_frame, (blink_delay_ms*blink_num*2)+200,0) )
						ret = -EPERM;
				}
			}
				break;

			case 0x06: //continuous write byte test
			{
				u16 reg = arg;
				u16 start_value = 0;
				u32 write_num = extra_arg;
				int i;
				u8 final;

				{
					struct xmit_frame	*xmit_frame;

					if((xmit_frame=rtw_IOL_accquire_xmit_frame(padapter)) == NULL) {
						ret = -ENOMEM;
						break;
					}

					for(i=0;i<write_num;i++){
						#ifdef CONFIG_IOL_NEW_GENERATION
						rtw_IOL_append_WB_cmd(xmit_frame, reg, i+start_value,0xFF);
						#else
						rtw_IOL_append_WB_cmd(xmit_frame, reg, i+start_value);
						#endif
					}
					if(_SUCCESS != rtw_IOL_exec_cmds_sync(padapter, xmit_frame, 5000,0))
						ret = -EPERM;
				}

				if(start_value+write_num-1 == (final=rtw_read8(padapter, reg)) ) {
					DBG_8723A("continuous IOL_CMD_WB_REG to 0x%x %u times Success, start:%u, final:%u\n", reg, write_num, start_value, final);
				} else {
					DBG_8723A("continuous IOL_CMD_WB_REG to 0x%x %u times Fail, start:%u, final:%u\n", reg, write_num, start_value, final);
				}
			}
				break;

			case 0x07: //continuous write word test
			{
				u16 reg = arg;
				u16 start_value = 200;
				u32 write_num = extra_arg;

				int i;
				u16 final;

				{
					struct xmit_frame	*xmit_frame;

					if((xmit_frame=rtw_IOL_accquire_xmit_frame(padapter)) == NULL) {
						ret = -ENOMEM;
						break;
					}

					for(i=0;i<write_num;i++){
						#ifdef CONFIG_IOL_NEW_GENERATION
						rtw_IOL_append_WW_cmd(xmit_frame, reg, i+start_value,0xFFFF);
						#else
						rtw_IOL_append_WW_cmd(xmit_frame, reg, i+start_value);
						#endif
					}
					if(_SUCCESS !=rtw_IOL_exec_cmds_sync(padapter, xmit_frame, 5000,0))
						ret = -EPERM;
				}

				if(start_value+write_num-1 == (final=rtw_read16(padapter, reg)) ) {
					DBG_8723A("continuous IOL_CMD_WW_REG to 0x%x %u times Success, start:%u, final:%u\n", reg, write_num, start_value, final);
				} else {
					DBG_8723A("continuous IOL_CMD_WW_REG to 0x%x %u times Fail, start:%u, final:%u\n", reg, write_num, start_value, final);
				}
			}
				break;

			case 0x08: //continuous write dword test
			{
				u16 reg = arg;
				u32 start_value = 0x110000c7;
				u32 write_num = extra_arg;

				int i;
				u32 final;
				struct xmit_frame	*xmit_frame;

				if((xmit_frame=rtw_IOL_accquire_xmit_frame(padapter)) == NULL) {
					ret = -ENOMEM;
					break;
				}

				for(i=0;i<write_num;i++){
					#ifdef CONFIG_IOL_NEW_GENERATION
					rtw_IOL_append_WD_cmd(xmit_frame, reg, i+start_value,0xFFFFFFFF);
					#else
					rtw_IOL_append_WD_cmd(xmit_frame, reg, i+start_value);
					#endif
				}
				if(_SUCCESS !=rtw_IOL_exec_cmds_sync(padapter, xmit_frame, 5000,0))
					ret = -EPERM;


				if(start_value+write_num-1 == (final=rtw_read32(padapter, reg)) ) {
					DBG_8723A("continuous IOL_CMD_WD_REG to 0x%x %u times Success, start:%u, final:%u\n", reg, write_num, start_value, final);
				} else {
					DBG_8723A("continuous IOL_CMD_WD_REG to 0x%x %u times Fail, start:%u, final:%u\n", reg, write_num, start_value, final);
				}
			}
				break;
			#endif //CONFIG_IOL
			break;
		case 0x79:
			{
				/*
				* dbg 0x79000000 [value], set RESP_TXAGC to + value, value:0~15
				* dbg 0x79010000 [value], set RESP_TXAGC to - value, value:0~15
				*/
				u8 value =  extra_arg & 0x0f;
				u8 sign = minor_cmd;
				u16 write_value = 0;

				DBG_8723A("%s set RESP_TXAGC to %s %u\n", __func__, sign?"minus":"plus", value);

				if (sign)
					value = value | 0x10;

				write_value = value | (value << 5);
				rtw_write16(padapter, 0x6d9, write_value);
			}
			break;
		case 0x7a:
			receive_disconnect(padapter, pmlmeinfo->network.MacAddress
				, WLAN_REASON_EXPIRATION_CHK);
			break;
		case 0x7F:
			switch(minor_cmd)
			{
				case 0x0:
					DBG_8723A("fwstate=0x%x\n", get_fwstate(pmlmepriv));
					break;
				case 0x01:
					DBG_8723A("auth_alg=0x%x, enc_alg=0x%x, auth_type=0x%x, enc_type=0x%x\n",
						psecuritypriv->dot11AuthAlgrthm, psecuritypriv->dot11PrivacyAlgrthm,
						psecuritypriv->ndisauthtype, psecuritypriv->ndisencryptstatus);
					break;
				case 0x02:
					DBG_8723A("pmlmeinfo->state=0x%x\n", pmlmeinfo->state);
					break;
				case 0x03:
					DBG_8723A("qos_option=%d\n", pmlmepriv->qospriv.qos_option);
#ifdef CONFIG_80211N_HT
					DBG_8723A("ht_option=%d\n", pmlmepriv->htpriv.ht_option);
#endif //CONFIG_80211N_HT
					break;
				case 0x04:
					DBG_8723A("cur_ch=%d\n", pmlmeext->cur_channel);
					DBG_8723A("cur_bw=%d\n", pmlmeext->cur_bwmode);
					DBG_8723A("cur_ch_off=%d\n", pmlmeext->cur_ch_offset);
					break;
				case 0x05:
					psta = rtw_get_stainfo(pstapriv, cur_network->network.MacAddress);
					if(psta)
					{
						int i;
						struct recv_reorder_ctrl *preorder_ctrl;

						DBG_8723A("SSID=%s\n", cur_network->network.Ssid.Ssid);
						DBG_8723A("sta's macaddr:" MAC_FMT "\n", MAC_ARG(psta->hwaddr));
						DBG_8723A("cur_channel=%d, cur_bwmode=%d, cur_ch_offset=%d\n", pmlmeext->cur_channel, pmlmeext->cur_bwmode, pmlmeext->cur_ch_offset);
						DBG_8723A("rtsen=%d, cts2slef=%d\n", psta->rtsen, psta->cts2self);
						DBG_8723A("state=0x%x, aid=%d, macid=%d, raid=%d\n", psta->state, psta->aid, psta->mac_id, psta->raid);
#ifdef CONFIG_80211N_HT
						DBG_8723A("qos_en=%d, ht_en=%d, init_rate=%d\n", psta->qos_option, psta->htpriv.ht_option, psta->init_rate);
						DBG_8723A("bwmode=%d, ch_offset=%d, sgi=%d\n", psta->htpriv.bwmode, psta->htpriv.ch_offset, psta->htpriv.sgi);
						DBG_8723A("ampdu_enable = %d\n", psta->htpriv.ampdu_enable);
						DBG_8723A("agg_enable_bitmap=%x, candidate_tid_bitmap=%x\n", psta->htpriv.agg_enable_bitmap, psta->htpriv.candidate_tid_bitmap);
#endif //CONFIG_80211N_HT

						for(i=0;i<16;i++)
						{
							preorder_ctrl = &psta->recvreorder_ctrl[i];
							if(preorder_ctrl->enable)
							{
								DBG_8723A("tid=%d, indicate_seq=%d\n", i, preorder_ctrl->indicate_seq);
							}
						}

